index="windows" source="XmlWinEventLog:Security" EventID=4688
| eval np = lower(coalesce(new_process, new_process_name, ""))
| eval pp = lower(coalesce(parent_process, parent_process_name, parent_process_path, ""))
| eval pe = lower(coalesce(process_exec, ""))
| where like(np, "%mimikatz.exe%") OR like(pp, "%mimikatz.exe%") OR like(pe, "%mimikatz.exe%")
